Tekla.Structures.Catalogs.CatalogObjectTypeEnum.BUILDING
The building object type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.BUILDING_SECTION
The building section object type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.STOREY
The storey object type.